app/Models/ModelTransaksi.php

    public function getpelanggan()
    {
        $builder=$this->db->table('tbl_pelanggan2110016');
        return $builder->get();
---
SELECT *
FROM `tbl_pelanggan2110016`

    public function gettarif()
    {
        $builder=$this->db->table('tbl_tarif2110016');
        return $builder->get();
---
SELECT *
FROM `tbl_tarif2110016`