app/Models/ModelPelanggan.php

    public function getpelanggan()
    {
        $builder=$this->db->table('tbl_pelanggan2110016');
        return $builder->get();
---
SELECT *
FROM `tbl_pelanggan2110016`