app/Models/ModelTarif.php

SELECT *
FROM `tbl_tarif2110016`
---
    public function gettarif()
    {
        $builder=$this->db->table('tbl_tarif2110016');
        return $builder->get();